app/controllers/movies_controller.rb

INSERT INTO "movies" ("name", "genre", "description", "is_favorite", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save